{
    "basic_info_search": [
        "Hi, What does [part_number] look like?",
        "What does [part_number] look like?",
        "Which industry is [part_number] used in?",
        "Which industries will use [part_number]?",
        "What is the packaging of [part_number]?",
        "What is the packaging method of [part_number]?",
        "Can you provide me with an image or description of [part_number]?",
        "I'm curious about the appearance of [part_number]. Could you share any visual representations or descriptions?",
        "Visualize [part_number] for me. What does it physically resemble?",
        "I'd like to see what [part_number] actually looks like. Can you show me a picture or describe its appearance?",
        "Depict [part_number] visually. Is there a photograph or sketch you could share?",
        "Could you describe the appearance of [part_number]?",
        "How would you characterize the physical attributes of [part_number]?",
        "Can you provide a visual description of [part_number]?",
        "What are the distinguishing features of [part_number] in terms of its appearance?",
        "Could you furnish me with an image or a written description that captures the visual characteristics of [part_number]?",
        "In what sector is [part_number] employed?",
        "What type of business utilizes [part_number]?",
        "Which industrial niche is [part_number] applicable to?",
        "Within which industry does [part_number] find its application?",
        "Can you identify the industry where [part_number] is commonly used?",
        "What business sectors are likely to utilize [part_number]?",
        "In which industries is [part_number] expected to find application?",
        "Identify the industries that will leverage the functionality of [part_number].",
        "Which industries have a need for the services or products provided by [part_number]?",
        "What are the potential market segments for [part_number] across different industries?",
        "Describe the materials and format used to encapsulate [part_number].",
        "Provide details about the container and packaging specifications for [part_number].",
        "Can you specify the type of packaging utilized for [part_number]?",
        "Please outline the materials and design of the protective covering for [part_number].",
        "Elaborate on the physical presentation and container used to house [part_number].",
        "How is [part_number] packaged?",
        "What is the packaging format employed for [part_number]?",
        "In what manner is [part_number] packaged or shipped?",
        "What are the packaging specifications for [part_number]?",
        "Describe the packaging methodology used for [part_number]."
    ],
    "market_price_search": [
        "Help me search a suitable price for [part_number]",
        "Can you find the market storage for [part_number]?",
        "Can you help to check the market price for [part_number]?",
        "What is the market price for [part_number]?",
        "Please search for some reference market information for [part_number]",
        "Assist me in finding an appropriate price for [part_number].",
        "Can you help me locate a reasonable price point for [part_number]?",
        "I need assistance in identifying an affordable price for [part_number].",
        "Please provide guidance on how to search for a suitable price for [part_number].",
        "Can you help me determine a cost-effective price for [part_number]?",
        "Where can I locate the market storage for [part_number]?",
        "Could you provide me with the location of the market storage where [part_number] is kept?",
        "I am seeking the market storage facility that houses [part_number]. Can you assist me?",
        "Is there a specific market storage location designated for [part_number]? If so, please share it.",
        "Can you help me identify the exact market storage area that contains [part_number]?",
        "Please assist in verifying the current market value of [part_number].",
        "Can you kindly provide the market rate for [part_number]?",
        "I would appreciate it if you could assist in determining the prevailing market price for [part_number].",
        "Could you please help me check the prevailing market cost of [part_number]?",
        "Is it possible for you to assist in retrieving the current market value associated with [part_number]?",
        "Could you please provide me with the current market value for [part_number]?",
        "What is the going rate in the market for [part_number]?",
        "Can you inform me of the prevailing market price for [part_number]?",
        "What is the estimated value of [part_number] on the open market?",
        "I'm interested in the market price for [part_number]. Can you offer that information?",
        "I would appreciate it if you could locate some background market data for [part_number].",
        "Kindly provide me with any market-related references you may have on hand for [part_number].",
        "If possible, please send me any market research materials that may be available for [part_number].",
        "Are there any market benchmarks you can share for [part_number]?",
        "I'm seeking market intelligence pertaining to [part_number]. Can you help me find some relevant sources?"
    ],
    "erp_storage_search": [
        "Any storage for [part_number] in ERP?",
        "Can you check the storage for [part_number] in ERP?",
        "Can you help to check the storage for [part_number] in ERP?",
        "Do you know if there is any stock for [part_number] in ERP?",
        "Can you help to check the stock for [part_number] in ERP in the latest [time_period]?",
        "Can you help to check the stock for [part_number] in ERP in the past [time_period]?",
        "Are there any [part_number] items currently stored in the ERP system?",
        "Does the ERP system record the inventory availability of [part_number]?",
        "Can you confirm whether the ERP maintains any stock records for [part_number]?",
        "Is there any ERP data indicating the availability of [part_number] in storage?",
        "Do you have any information in the ERP regarding the inventory status of [part_number]?",
        "Could you verify the ERP system to determine the availability of [part_number] in stock?",
        "Can you perform an inventory check in the ERP system to confirm the stock levels of [part_number]?",
        "Please review the ERP database to identify the storage location and quantity of [part_number].",
        "Could you please check the ERP inventory module to ascertain the storage location and availability of [part_number]?",
        "Is it possible for you to access the ERP system and provide information regarding the storage location and quantity of [part_number]?",
        "Is it possible to verify the availability of [part_number] in ERP's storage system?",
        "Could you assist in retrieving the storage status of [part_number] from ERP?",
        "Can you verify the inventory status of [part_number] within the ERP storage module?",
        "I need your assistance in checking the ERP storage system for the stock availability of [part_number].",
        "Please help me determine the quantity of [part_number] currently stored in ERP's inventory system.",
        "Can you tell me if [part_number] has any inventory in the ERP system?",
        "Is there any availability of [part_number] in the ERP database?",
        "I'm looking to verify if we have stock for [part_number] in ERP. Can you assist?",
        "Could you please check if [part_number] is in stock according to ERP records?",
        "Can you confirm if there is any inventory listed for [part_number] within the ERP?",
        "Can you please verify the availability of part number [part_number] in the ERP system for the most recent [time_period]?",
        "I would like to inquire about the current inventory level of [part_number] in ERP as of [time_period]. Could you assist with this?",
        "Can you confirm if there is any stock remaining for part number [part_number] in ERP, considering the transactions that occurred up to [time_period]?",
        "I need assistance with checking the ERP records to determine if there is any on-hand inventory for part [part_number]. Could you provide me with the current stock status from the system, specifically for the [time_period]?",
        "Please verify the stock availability of [part_number] by reviewing the ERP system. Ensure that the timeframe considered for the inventory check is [time_period].",
        "I need assistance verifying the stock availability of [part_number] in the ERP system within the preceding [time_period].",
        "Could you please ascertain the current stock level for [part_number] in ERP, as per the historical data for the previous [time_period]?",
        "Please conduct a stock inquiry in ERP for [part_number] and provide the results for the period ending [time_period] ago.",
        "I would like to request a stock check for [part_number] in the ERP system, covering the period up to and including [time_period] in the past.",
        "Can you assist me in retrieving stock information for [part_number] from ERP, with a focus on the last [time_period]?"
    ],
    "erp_historical_orders": [
        "Can you help to check the historical orders for [part_number] in ERP?",
        "Do you know if there is any historical order for [part_number] in ERP?",
        "Can you help to check the historical orders for [part_number] in ERP in the latest [time_period]?",
        "Can you help me to check if there are any successful orders for [part_number] in ERP?",
        "Can you help me to check if there are any successful orders for [part_number] in ERP in the past [time_period]?",
        "Please assist me in retrieving historical order information for [part_number] from the ERP system.",
        "Could you provide insight into past orders placed for [part_number] within the ERP?",
        "I require assistance in identifying prior orders for [part_number] in the ERP database.",
        "Is it possible for you to check the ERP system for any previous orders pertaining to [part_number]?",
        "Can you retrieve historical order details for [part_number] by accessing the ERP system?",
        "Is there a defined chronological sequence for [part_number] within the Enterprise Resource Planning (ERP) system?",
        "Is there a particular historical order associated with [part_number] in the ERP environment?",
        "Does the ERP system maintain a historical record of the order in which [part_number] was processed or utilized?",
        "Is the sequence of events related to [part_number] captured in any chronological format within the ERP system?",
        "Can you provide information on the historical order of transactions or activities associated with [part_number] as recorded in the ERP system?",
        "Can you please assist in verifying any successful historical orders for [part_number] within the ERP system during the recent [time_period]?",
        "Could you kindly check and confirm if there are any previously placed orders for [part_number] within the ERP database that were successfully processed?",
        "Is it possible to review the historical orders associated with [part_number] in the ERP system and identify if any of them were completed successfully within the specified [time_period]?",
        "Can you help me determine if there are any records of successfully processed orders for [part_number] within the ERP system during the latest [time_period]?",
        "I would like to know if there are any orders for [part_number] in the ERP system within the last [time_period] that resulted in a successful outcome. Could you please help me with this verification?",
        "I'm looking for assistance in determining if there have been any fulfilled orders for [part_number] within the [time_period] timeframe in ERP.",
        "Can you assist me in verifying the existence of any completed orders for [part_number] within the past [time_period] in ERP?",
        "I need help identifying whether there are any orders that have been successfully processed for [part_number] during the [time_period] in ERP.",
        "Could you please check ERP to confirm if any orders for [part_number] have reached a completed status within the specified [time_period]?",
        "I'm requesting assistance in verifying whether ERP contains any records of successful orders for [part_number] that occurred within the [time_period]."
    ],
    "quotation_prediction": [
        "Can you predict the price of [part_number] with [quantity] pieces?",
        "Can you predict the price of [part_number] with [quantity] pieces in the future?",
        "Can you give me a reference quotation about [part_number] with [quantity] units?",
        "Can you give me a reference quotation about [part_number] with [quantity] units from the customer [customer_name]?",
        "Can you predict the price of [part_number] with [quantity] pieces from the customer [customer_name]?",
        "Is it possible to forecast the cost of [part_number] when purchasing [quantity] units?",
        "Please provide an estimate of the cost for [part_number] based on a quantity of [quantity] pieces.",
        "Can you generate a price projection for [part_number] given the purchase quantity of [quantity]?",
        "I would like to request a prediction of the price for [part_number] considering a quantity of [quantity].",
        "Is there any way you could predict the cost of purchasing [quantity] pieces of [part_number]?",
        "Is it possible to forecast the future cost of [part_number] given a demand for [quantity] units?",
        "Can you provide an estimate of the expected pricing for [part_number] if we procure [quantity] of them?",
        "What are the predictive models available to determine the potential cost of [part_number] in the future, assuming we need [quantity] units?",
        "Could you estimate the price of [part_number] if we were to purchase [quantity] pieces in the future?",
        "Do you have any insights into the future pricing of [part_number] for a demand of [quantity] units?",
        "Could you provide a quote that includes a reference to [part_number] and [quantity] units?",
        "I am seeking a quote with a reference to [part_number] and including [quantity] units.",
        "Can you supply me with a quote that includes a reference to [part_number] and indicates a quantity of [quantity] units?",
        "Please generate a quote that references [part_number] and specifies a quantity of [quantity] units.",
        "Is it possible to obtain a quote that includes a reference to [part_number] and a quantity of [quantity] units?",
        "I need a reference quote for [quantity] units of [part_number] from [customer_name].",
        "Please provide a reference quotation for [customer_name] for [quantity] units of [part_number].",
        "Can you send me a reference quotation for [part_number] from [customer_name] with [quantity] units?",
        "I would like to request a reference quotation for [quantity] units of [part_number] from [customer_name].",
        "Can you give me a quote referencing previous orders from [customer_name] for [part_number], specifically [quantity] units?",
        "Forecast the cost of purchasing [part_number], with [quantity] units from [customer_name].",
        "Estimate the cost of [quantity] units of [part_number] from [customer_name].",
        "Provide a projection for the price of [part_number] when [quantity] units are ordered from [customer_name].",
        "Can you determine the price of [part_number] when [customer_name] orders [quantity] units?",
        "Predict the cost of [quantity] pieces of [part_number] if ordered by [customer_name]."
    ]
}